---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectNotDeleted
source: html/7deaea02-3adf-bdda-6e10-9adf350240e1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectNotDeleted Property

Pinned objects were not deleted. To delete them, unpin them before using delete.

## Syntax (C#)
```csharp
public static FailureDefinitionId PinnedObjectNotDeleted { get; }
```